package com.company.day015_arr1_1;

import java.util.Arrays;

public class Arr1Ex012 {
	public static void main(String[] args) {
		int mon[] = { 0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };
		String yoil[] = { "일", "월", "화", "수", "목", "금", "토" };

		int year = 2020;
		int month = 10;
		int day = 13;
		int sum = 0;
		String todayyoil = " ";

		// 1. 서기 1년 ~ 2020년 10월 13일 총일수
		// ver0
		/*
		 * 년 -> 서기 1년 ~ 2019년 윤년인지 판단 후 366:365 월 -> 1월 ~ 9월 2020년이 윤년인지 판단 후 1 더하기 일 ->
		 * 13
		 * 
		 * =========== HINT!!!============ #1. 년단위 서기 1년은 윤년인지 판단 후 윤년이 아니라면 365 서기 2년은
		 * 윤년인지 판단 후 윤년이 아니라면 365 서기 3년은 윤년인지 판단 후 윤년이 아니라면 365 서기 4년은 윤년인지 판단 후 윤년이
		 * 아니라면 365 ........중간생략.......... 서기 2019년은 윤년인지 판단 후 윤년이 아니라면 365 for(서기 1년 ;
		 * 2019년도까지; 1개씩 증가) {sum += 윤년인지 판단 후 365:366}
		 * 
		 * #2. 월단위 10월달은 일수가 모자르므로 9월달까지 계산 윤년인지 판단 : 윤년이라면 2월을 29일 * int mon [] = {0,
		 * 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
		 * 
		 * #3. 일단위 : 13일
		 * 
		 * 
		 * #4. 1+2+3 더하기
		 * 
		 * 2. 요일구하기 yoil[1] => 월요일 1%7 yoil[2] => 화요일 2%7 yoil[3] => 수요일 3%7 yoil[4] =>
		 * 목요일 4%7 yoil[5] => 금요일 5%7 yoil[6] => 토요일 6%7 yoil[0] => 일요일 0%7
		 * 
		 * => yoil[i] i%7
		 * 
		 * 3. 화면처럼 달력 나오게 구하기
		 * 
		 */

		/*
		 * sum += 1%4==0 && 1%100! == 0 || 1%400 == 0? 366 : 365; sum += 2%4==0 &&
		 * 1%100! == 0 || 2%400 == 0? 366 : 365; sum += 3%4==0 && 1%100! == 0 || 3%400
		 * == 0? 366 : 365; sum += 4%4==0 && 1%100! == 0 || 4%400 == 0? 366 : 365;
		 */

		// 1. 총일수 구하기
		for (int i = 0; i < year; i++) {
			sum += year % 4 == 0 && !(year % 100 == 0) || year % 400 == 0 ? 366 : 365;
		}

		System.out.println("* 서기 1년 ~ 오늘 총 일수 : " + sum);

		// 2. 요일 구하기

		// 3. 달력 출력하기
		System.out.println("====== 10월 ======");

		for (int i = 0; i < yoil.length; i++) {
			System.out.print(yoil[i] + "\t");
		}
		System.out.println();

		// 3-1 * * * 의 갯수 구하기 -> 10월 1일의 요일 (시작 요일)
		int start = (sum = day + 1) % 7;
		// 3-2 31일 (마지막 날)

		for (int i = 0; i <= start + mon[month]; i++) {
			System.out.print((i <= start) ? "*\t" : (i - start) + "\t"); // * 또는 숫자
			if (i % 7 == 0)
				System.out.println();
		}

	}
}
