package com.company.day006;

public class A002 {
	public static void main(String[] args) {
		int a = 10;
		/*
		1. 먼저() -> a%2 == 0 
		2. 값을 구하고 (++,--,*,/,<<, >>)
		3. 비교 ( <, >)
		4. 조건( &&, ||)후
		5. 대입(==)
		*/
		
		
//		Q1) a가 짝수라면 true 출력 아니라면 fasle 출력
//			1. 짝수 2,4,6,8
//			2. 1이 짝수라면  1%2 == 0 
//			   2이 짝수라면  2%2 == 0
//			   3이 짝수라면  3%2 == 0
		System.out.println("a가 짝수라면 : " + (a%2 == 0));
		
//		Q2) 비교연산자 이용해서 a가 3의 배수라면 true 출력 아니라면 false 출력
//			1. 3의 배수 3,6,9
/*
 * 			2. 0,1,2 중의 하나가 나머지	
 * 				1%3 -> 1을 3으로 나눴을 때 나머지 1
				2%3 -> 3을 3으로 나눴을 때 나머지 2
				3%3 -> 3을 3으로 나눴을 때 나머지 0
				4%3 -> 4을 3으로 나눴을 때 나머지 1		 
 */
		System.out.println("a가 3의 배수라면 : " + (a%3 == 0));
		
	}
}
